// Физика полета (аккуратный, близкий всплеск)
direction = random_range(0, 360);
speed     = random_range(3, 4); // УМЕНЬШЕНО: Медленный вылет на старте
friction  = 0.1;                  // Плавное торможение

// Переменные для высоты (Z-ось)
z          = random_range(2, 4);   // Низкая начальная высота
z_speed    = random_range(0.8, 1.5); // Слабый подскок вверх
gravity_z  = 0.25;                 // Гравитация

// Вращение и масштаб
rot_speed   = random_range(4, 9) * choose(-1, 1); // УМЕНЬШЕНО: Теперь крутятся медленно и плавно
base_scale  = 1; // Базовый масштаб спрайта
